Autodesk.Revit.DB.DimensionType.CanHaveOrdinateDimensionSetting
Checks whether this DimensionType can have an ordinate dimension settings.
Remarks:
It returns true when the DimensionType is linear and when Dimension String Type parameter is set to Ordinate.
Returns:
True when the DimensionType is linear and the Dimension String Type parameter is ordinate, false otherwise.

Autodesk.Revit.DB.DimensionType.SetOrdinateDimensionSetting(Autodesk.Revit.DB.OrdinateDimensionSetting)
Sets the ordinate dimension settings for this DimensionType.
ordinateDimSetting:
The new ordinate dimension settings.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The origin tick mark id in the Ordinate Dimension Setting is invalid for the dimension style.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This DimensionType cannot be assigned ordinate dimension settings, as it is not a linear DimensionType or its Dimension String Type parameter is not set to Ordinate.
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionType.GetOrdinateDimensionSetting
Gets the ordinate dimension settings for this DimensionType.
Returns:
The ordinate dimension settings.
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionType.CanHaveEqualityFormula
Checks whether this DimensionType can have an equality formula.
Remarks:
Equality formulas can be used for continuous linear or angular dimension types.
Returns:
True when the DimensionType is continuous linear or angular, false otherwise

Autodesk.Revit.DB.DimensionType.SetEqualityFormula(System.Collections.Generic.IList{Autodesk.Revit.DB.DimensionEqualityLabelFormatting})
Sets an ordered list of the entries to use in the equality formula definition.
formattingArr:
An ordered list of the entries to use in the equality formula definition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The input equality formula entries are not valid for use in the given DimensionType.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionType.GetEqualityFormula
Gets an ordered list of the entries in the equality formula definition.
Returns:
An ordered list of the entries in the equality formula definition.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The given DimensionType cannot be assigned an equality formula as it is not continuous linear or angular.
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionType.SetUnitsFormatOptions(Autodesk.Revit.DB.FormatOptions)
Sets the FormatOptions to optionally override the default settings in the Units class for the units value.
Remarks:
See the UnitType property to determine the unit type of this dimension style.
formatOptions:
The FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The display unit in formatOptions is not a valid display unit for the unit type of this DimensionType, or the rounding method in formatOptions is not set to Nearest.  See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType), UnitUtils.GetValidDisplayUnits(UnitType) and FormatOptions.RoundingMethod.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionType.GetUnitsFormatOptions
Gets the FormatOptions to optionally override the default settings in the Units class for the units value.
Returns:
A copy of the FormatOptions.
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionType.SetAlternateUnitsFormatOptions(Autodesk.Revit.DB.FormatOptions)
Sets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
Remarks:
See the UnitType property to determine the unit type of this dimension style.
formatOptions:
The FormatOptions.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The display unit in formatOptions is not a valid display unit for the unit type of this DimensionType, or the rounding method in formatOptions is not set to Nearest.  See UnitUtils.IsValidDisplayUnit(UnitType, DisplayUnitType), UnitUtils.GetValidDisplayUnits(UnitType) and FormatOptions.RoundingMethod.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.DimensionType.GetAlternateUnitsFormatOptions
Gets the FormatOptions to optionally override the default settings in the Units class for the alternate units value.
Returns:
A copy of the FormatOptions.

Autodesk.Revit.DB.DimensionType.UnitType
The unit type of this dimension style.
Remarks:
The unit type will either be UT_Length, UT_Angle or UT_Slope.

Autodesk.Revit.DB.DimensionType.AlternateUnitsSuffix
The suffix text for the alternate units value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.DimensionType.AlternateUnitsPrefix
The prefix text for the alternate units value.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL

Autodesk.Revit.DB.DimensionType.AlternateUnits
The alternate units display mode for this DimensionType.
Alternate units let dimensions display values in multiple units.
For example, for a dimension which shows its values in imperial units,
alternate units can be used to repeat those values in metric units.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.DimensionType.StyleType
The dimension style type of this DimensionType.

Autodesk.Revit.DB.DimensionType
An object that represents a dimension style.